int/resources/objectRepo/xmlTemplates/opera/FrontDeskOperations/req_CheckinReservation.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/fof/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:CheckinReservationRQ CorrelationID="?" EchoToken="?" Enforce="?" IncludeNotifications="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:Reservations>
            <v9:Reservation IgnoreWarnings="?" PrintRegistration="?" ProfilePrivacyPrompted="?" StopCheckin="?">
               <v91:HotelCode/>
               <v91:ReservationIDList>
                  <v91:UniqueID ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
               </v91:ReservationIDList>
               <v91:RoomNo/>
               <v91:CheckOutTime/>
               <v91:StartCheckInProcessTime/>
               <v91:EndCheckInProcessTime/>
               <v91:LockHandle/>
            </v9:Reservation>
         </v9:Reservations>
         <v9:FetchReservationInstruction/>
      </v9:CheckinReservationRQ>
   </soapenv:Body>
</soapenv:Envelope>